In [41]:
import numpy as np
import matplotlib as mpl
import matplotlib.pyplot as plt
import pandas as pd

In [42]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'

In [43]:
# read the above file

In [44]:
df = pd.read_csv(url, sep='\t')

In [45]:
# print first 5 and last 7 records

In [46]:
df.head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [47]:
df.tail(7)

,order_id,quantity,item_name,choice_description,item_price
4615,1832,1,Chicken Soft Tacos,"[Fresh Tomato Salsa, [Rice, Cheese, Sour Cream]]",$8.75
4616,1832,1,Chips and Guacamole,NaN,$4.45
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [48]:
# print total records and type of variables

In [49]:
df.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [50]:
# How is the dataset indexed?

In [51]:
df.index

RangeIndex(start=0, stop=4622, step=1)

In [52]:
# Which was the most ordered item? and How many items were ordered?

In [53]:
df.groupby('item_name').sum().sort_values(by=['quantity'], ascending = False).head(1)

              order_id  quantity
item_name
Chicken Bowl    713926       761

In [54]:
# What was the most ordered item in the choice_description column?

In [55]:
df.groupby('choice_description').sum().sort_values(by=['quantity'], ascending = False).head(1)

                    order_id  quantity
choice_description
[Diet Coke]           123455       159

In [56]:
# Turn the item price into a float

In [57]:
df['item_price'][1:-1]

1        $3.39
2        $3.39
3        $2.39
4       $16.98
5       $10.98
         ...
4616     $4.45
4617    $11.75
4618    $11.75
4619    $11.25
4620     $8.75
Name: item_price, Length: 4620, dtype: object

In [58]:
fun1 = lambda x: float(x[1:-1])
df['item_price'] = df.item_price.apply(fun1)

In [59]:
df['item_price'].head()

0     2.39
1     3.39
2     3.39
3     2.39
4    16.98
Name: item_price, dtype: float64

In [60]:
# How much was the revenue for the period in the dataset?

In [61]:
revenue = (df['quantity']*df['item_price']).sum()
print("The revenue is " +'$'+ str(revenue))

The revenue is $39237.02

In [62]:
# print a dataframe with only two columns: item_name and item_price

In [63]:
df[['item_name','item_price']].head()

                               item_name  item_price
0           Chips and Fresh Tomato Salsa        2.39
1                                   Izze        3.39
2                       Nantucket Nectar        3.39
3  Chips and Tomatillo-Green Chili Salsa        2.39
4                           Chicken Bowl       16.98

In [64]:
# delete the duplicates in item_name and quantity

In [65]:
df1 = df.drop_duplicates(subset = ['item_name','item_price'])

In [66]:
# Select only the products with quantity equals to 1

In [67]:
quantity_one = df1[df1['quantity'] == 1]
quantity_one.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",10.98

In [68]:
# Select only the item_name and item_price columns

In [69]:
item_price = quantity_one[['item_name', 'item_price']]
item_price.head()

                               item_name  item_price
0           Chips and Fresh Tomato Salsa        2.39
1                                   Izze        3.39
2                       Nantucket Nectar        3.39
3  Chips and Tomatillo-Green Chili Salsa        2.39
5                           Chicken Bowl       10.98

In [70]:
# sort the values from the most to less expensive

In [71]:
df_sorted = df.sort_values(by = 'item_price', ascending = False)

In [72]:
# What was the quantity of the most expensive item ordered?

In [73]:
df_sorted.head(1)

,order_id,quantity,item_name,choice_description,item_price
3598,1443,15,Chips and Fresh Tomato Salsa,NaN,44.25

In [74]:
# How many times were a veggie salad Bowl ordered?

In [84]:
df_salad = df[df['item_name']=='Veggie Salad Bowl']

In [85]:
times = df_salad['quantity'].sum()

18

In [ ]:
print(times) # number of times salad was ordered.

## 2nd Pandas Practice

In [88]:
url = 'http://bit.ly/drinksbycountry'
df = pd.read_csv(url)

In [89]:
df.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [37]:
# which continent drinks more beer on average?

In [97]:
df_continent = df.groupby('continent')

In [98]:
df_continent['beer_servings'].mean()

continent
Africa            61.471698
Asia              37.045455
Europe           193.777778
North America    145.434783
Oceania           89.687500
South America    175.083333
Name: beer_servings, dtype: float64

In [38]:
# for each continent print the statstics for wine consumption

In [100]:
df.groupby('continent').wine_servings.describe()

               count        mean        std  min   25%    50%     75%    max
continent
Africa          53.0   16.264151  38.846419  0.0   1.0    2.0   13.00  233.0
Asia            44.0    9.068182  21.667034  0.0   0.0    1.0    8.00  123.0
Europe          45.0  142.222222  97.421738  0.0  59.0  128.0  195.00  370.0
North America   23.0   24.521739  28.266378  1.0   5.0   11.0   34.00  100.0
Oceania         16.0   35.625000  64.555790  0.0   1.0    8.5   23.25  212.0
South America   12.0   62.416667  88.620189  1.0   3.0   12.0   98.50  221.0

#### Pandas practice - 3rd Data set

#### United States - Crime Rates - 1960 - 2014

In [135]:
url = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/04_Apply/US_Crime_Rates/US_Crime_Rates_1960_2014.csv'
crime = pd.read_csv(url,sep=',')
crime.head()

,Year,Population,Total,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft
0,1960,179323175,3384200,288460,3095700,9110,17190,107840,154320,912100,1855400,328200
1,1961,182992000,3488000,289390,3198600,8740,17220,106670,156760,949600,1913000,336000
2,1962,185771000,3752200,301510,3450700,8530,17550,110860,164570,994300,2089600,366800
3,1963,188483000,4109500,316970,3792500,8640,17650,116470,174210,1086400,2297800,408300
4,1964,191141000,4564600,364220,4200400,9360,21420,130390,203050,1213200,2514400,472800

In [136]:
# convert the type of the column year to datetime64

In [137]:
crime['Year'] = pd.to_datetime(crime['Year'], format = '%Y')
crime.head()

,Year,Population,Total,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft
0,1960-01-01,179323175,3384200,288460,3095700,9110,17190,107840,154320,912100,1855400,328200
1,1961-01-01,182992000,3488000,289390,3198600,8740,17220,106670,156760,949600,1913000,336000
2,1962-01-01,185771000,3752200,301510,3450700,8530,17550,110860,164570,994300,2089600,366800
3,1963-01-01,188483000,4109500,316970,3792500,8640,17650,116470,174210,1086400,2297800,408300
4,1964-01-01,191141000,4564600,364220,4200400,9360,21420,130390,203050,1213200,2514400,472800

In [138]:
crime.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 55 entries, 0 to 54
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Year                55 non-null     datetime64[ns]
 1   Population          55 non-null     int64
 2   Total               55 non-null     int64
 3   Violent             55 non-null     int64
 4   Property            55 non-null     int64
 5   Murder              55 non-null     int64
 6   Forcible_Rape       55 non-null     int64
 7   Robbery             55 non-null     int64
 8   Aggravated_assault  55 non-null     int64
 9   Burglary            55 non-null     int64
 10  Larceny_Theft       55 non-null     int64
 11  Vehicle_Theft       55 non-null     int64
dtypes: datetime64[ns](1), int64(11)
memory usage: 5.3 KB

In [139]:
# Set the year column as the index of the dataframe

In [140]:
crime.set_index('Year').head()
crime.index = pd.to_datetime(crime.index)  # Convert the integer timestamps in the index to a DatetimeIndex:

In [141]:
#Group the year by decades and sum the values

In [142]:
# resample the dataframe first
crimes = crime.resample('10AS').sum()

In [143]:
# Uses resample to get the max value only for the "Population" column
population = crime['Population'].resample('10AS').max()

In [145]:
# Updating the "Population" column
crimes['Population'] = population

In [146]:
crimes

,Population,Total,Violent,Property,Murder,Forcible_Rape,Robbery,Aggravated_assault,Burglary,Larceny_Theft,Vehicle_Theft
1970-01-01,318857056,583173026,65384309,517687418,952448,3999314,22904744,37464999,133320955,327797108,56573743

In [ ]:
#Return the first 3 rows of the Dataframe Df

In [ ]:
# Select just the 'Murder' and 'Robbery' columns from the DataFrame df and print the columns

In [ ]:
# Select the data in rows [3,4,8] and in columns ['Murder','Robbery']

In [ ]:
# Select only the rows where the number of murder is greater than 24,000

In [ ]:
# Select only the rows where the murder is greater than 24,000

In [ ]:
# select the rows where the murder is between 20k and 24k(inclusive)

In [ ]:
# Calculate the mean murder for each diffrent year in df

In [ ]:
# Sort df first by the values in the 'Murder' in descending order,
# then by the value in the 'Violent' column in ascending order.

In [ ]:
# Read the following dataset

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/vincentarelbundock/Rdatasets/

In [ ]:
df.head()

In [ ]:
# for each cyL type and each number of gears, find the mean mileage